Repository: alexkdeveloper/forgetpass-helium
Catalog: po/*.po
Languages: es, eu, it, nl

source: Simple password generator for websites
es: Generador de contraseñas sencillo para sitios web
eu: Pasahitzen sorgailu erraz bat webguneetarako
it: Semplice generatore di password per siti web
nl: Eenvoudige wachtwoordgenerator voor websites

source: Password;Manager;Security;Generate;Derive;
nl: Wachtwoord;Beheer;Beveiliging;Genereren;Afleiden;

source: You don't need to remember passwords anymore! All you need is a website name and a keyword that is easy to remember. The program will generate a strong password, and if you need it again, just enter the above data and you will get the same password.
es: ¡Ya no es necesario recordar contraseñas! Todo lo que necesitas es un nombre de sitio web y una palabra clave que sea fácil de recordar. El programa generará una contraseña fuerte, y si la necesitas de nuevo, sólo tienes que introducir los datos anteriores y obtendrás la misma contraseña.
eu: Ez da beharrezkoa pasahitzak gogoratzea! Behar duzun guztia webgunearen izen bat eta gogoratzeko erraza den hitz gako bat da. Programak pasahitz sendo bat sortuko du, eta berriro behar baduzu, aurreko datuak sartu eta pasahitz bera lortuko duzu.
it: Non è più necessario ricordare le password! Tutto ciò che serve è il nome di un sito web e una parola chiave facile da ricordare. Il programma genererà una password forte, e se ne hai bisogno di nuovo, inserisci i dati sopra ed otterrai la stessa password.
nl: U hoeft vanaf nu geen wachtwoorden meer te onthouden! Het enige wat u nodig heeft is de naam van een website en makkelijk te onthouden trefwoord. De toepassing genereert vervolgens een sterk wachtwoord dat u kunt opvragen middels het gekozen trefwoord.

source: Minor UI update
nl: Verbeterd: vormgeving

source: Updated Italian translation
nl: Bijgewerkt: Italiaanse vertaling

source: Port to AdwEntryRow
nl: Nieuw: gemigreerd naar AdwEntryRow

source: Added the ability to copy the password to the clipboard
nl: Nieuw: mogelijkheid om wachtwoord te kopiëren naar klembord

source: The app icon has been updated
nl: Bijgewerkt: toepassingspictogram

source: Added Spanish and Basque translations
nl: Nieuw: Spaanse en Baskische vertalingen

source: Update to GNOME Platform version 43
nl: Bijgewerkt: GNOME-platform naar versie 43

source: Pop-up messages were introduced
nl: Nieuw: pop-upmeldingen

source: Added Italian translation
nl: Nieuw: Italiaanse vertaling

source: Added Russian translation
nl: Nieuw: Russische vertaling

source: Libadwaita is included in the application
nl: Nieuw: Libadwaita wordt voorgaan meegeleverd

source: Added Dutch translation
nl: Nieuw: Nederlandse vertaling

source: Initial release
nl: Eerste versie

source: Site
es: Sitio
eu: Webgunea
it: Sito
nl: Website

source: Use only the domain name without prefixes, such as http or www, and endings, such as .com, etc.
es: Utilice sólo el nombre de dominio sin prefijos, como http o www, ni terminaciones, como .com, etc.
eu: Erabili soilik domeinu izena aurrizkirik gabe, adibidez http edo www, ezta amaierak ere, adibidez .com, etab.
it: Utilizza solo il nome di dominio senza prefissi, come http o www, e terminazioni, come .com, ecc.
nl: Let op: voer alléén de domeinnaam in, zonder voorvoegsels als http of www en zonder achtervoegsels als .nl of .com.

source: Keyword
es: Palabra clave
eu: Gako-hitza
it: Parola chiave
nl: Trefwoord

source: Be sure to remember the keyword! If you forget it, you won't be able to recover your password!
es: ¡Asegúrate de recordar la palabra clave! Si la olvidas, no podrás recuperar tu contraseña.
eu: Ziurtatu gako-hitza gogoratzen duzula! Ahazten baduzu, ezingo duzu zure pasahitza berreskuratu.
it: Assicurati di ricordare la parola chiave! Se la dimentichi, non sarai in grado di Recupera la tua password!
nl: Let op: onthoud dit trefwoord goed! Als u het woord vergeet, dan kunt u uw wachtwoord niet herstellen!

source: GENERATE
es: GENERAR
eu: SORTU
it: GENERARE
nl: GENEREREN

source: Enter the name of the site
es: Introduce el nombre del sitio
eu: Sartu webgunearen izena
it: Inserisci il nome del sito
nl: Voer de naam van de website in

source: Enter a keyword
es: Introduce una palabra clave
eu: Sartu gako-hitz bat
it: Inserisci una parola chiave
nl: Voer een trefwoord in

source: ERROR!!! Failed to generate password
es: ¡¡¡ERROR!!! No se ha podido generar la contraseña
eu: ERROREA!!! Ezin izan da pasahitza sortu
it: ERRORE!!! Impossibile generare la password
nl: FOUTMELDING!!! Het wachtwoord kan niet worden gegenereerd

source: _OK
nl: _Oké

source: password;generator;security;keyword;
es: contraseña;generador;seguridad;palabra clave;
eu: pasahitza;sorgailua;segurtasuna;gako-hitza;
it: password;generatore;sicurezza;parola chiave;

source: Message
es: Mensaje
eu: Mezua
it: Messaggio
